[{"name": "Enigma Escape Room", "text": "Home Rooms\nBomb SquadExorcistFairy TaleHannibalGodfatherJungle SafariMagic SchoolThe Lost Treasure\n Bomb Squad Exorcist Fairy Tale Hannibal Godfather Jungle Safari Magic School The Lost Treasure Gifts Reviews Events & Team Building Home Rooms\nBomb SquadExorcistFairy TaleHannibalGodfatherJungle SafariMagic SchoolThe Lost Treasure\n Bomb Squad Exorcist Fairy Tale Hannibal Godfather Jungle Safari Magic School The Lost Treasure Gifts Reviews Events & Team Building  Escape Rooms \n\n \nMax 9 players\n \n\n \n60 min\n \n\n \nMax 9 players\n \n\n \n60 min\n \n\n \nMax 9 players\n \n\n \n60 min\n \n\n \nMax 9 players\n \n\n \n60 min\n \n\n \nMax 9 players\n \n\n \n60 min\n \n\n \nMax 9 players\n \n\n \n60 min\n \n\n \nMax 7 players\n \n\n \n60 min\n \n\n \nMax 6 players\n \n\n \n60 min\n \n\n \nMax 6 players\n \n\n \n60 min\n Gameplay Footage exciting. rewarding. Suprising fun. Made for you Enigma Room is for thrill seekers and problem solvers.  Conveniently located on 130 Dundas St West, Toronto (next to Ryerson University). Past clients include Google, Apple, Uber, Microsoft, Coca Cola, Pepsi, Cineplex, RBC and more. Our escape rooms are made for all ages. There are no special skills needed to have a great time. Bring your friends, family, co-workers, field trip classmates and have fun. Whatever the celebration Enigma is here to take it to another level. Book your room and contact us to see how we can help make any special occasion even better. Enigma Canada Escape Rooms FAQ An escape game is a real-life experience where participants are locked in a room and must use elements of the room, the group’s collective knowledge, and wits to discover clues, solve puzzles, and escape and/or find the missing item within a set amount of time. You must solve the escape room in 60 minutes or less. Yes, please view our booking schedule for availabilities. You do not need to bring anything except your friends, and a clear mind. All ages can enjoy our games. Players 10 years or younger must be accompanied by at least 1 adult that is at least 18 years old. No, electronic devices are not allowed in our rooms. Lockers are provided to store your phones and your belongings before you go in the room. We only give full refunds for cancellations made 24 hours prior to your booking time. We can not give a refund for any last-minute cancellations within 24 hours. No. If you are not a fan of horror, we have many non-scary rooms including Godfather, Jungle, Pirate, Magic School, Fairy Tale, and Bomb Disposal. No! We never put strangers in your room. It’ll be only your team members playing with you in the room. Just click the “Book Now” button, and it will direct you to the booking page. Feel free to pay now or pay later. Yes, you can add more people after booking. Simply let our staff know when you walk in. We’ll adjust the booking for you. We accept cash, all major credit cards (Visa, Master Card, American Express) and debit cards as well. If your group arrives late, your game time might be affected. We try our best to keep our schedule on time, so we encourage all groups to arrive 10 minutes earlier.  Visit Us In Downtown Toronto 🍁 130 Dundas Street West, 3rd FloorToronto, Ontario, M5G 1C3 \n\n\n \n647-769-3628\n\n \n\n\n \ninfo@enigmaroom.ca\n\n", "latitude": 43.655663, "longitude": -79.3846061}, {"name": "Trapped Escape Rooms & Lounge Toronto", "text": "Home Themes Rates Corporate Events Franchise Locations & Contact FAQ Book Now!AjaxBarrieBurlingtonBurnabyCalgaryCoquitlamEdmontonGuelphKanataMarkhamMississaugaNewmarketNiagara FallsOshawaOttawaScarboroughTorontoDowntownTorontoMidtownVaughanWaterlooWindsor Ajax Barrie Burlington Burnaby Calgary Coquitlam Edmonton Guelph Kanata Markham Mississauga Newmarket Niagara Falls Oshawa Ottawa Scarborough TorontoDowntown TorontoMidtown Vaughan Waterloo Windsor Real Life Room Escape About Us As one of the largest and most renowned premium escape room chains across the globe, Trapped offers a truly unparalleled immersive escape experience that will leave you enchanted. From intricate puzzles to lavish sets, we take pride in every detail that goes into our game designs. Our mission is to create a world of wonder and adventure, where you can step into a real-life movie scenario and experience the thrill of the unknown. With locations worldwide, Trapped is the go-to destination for those seeking the ultimate in immersive entertainment. Whether you're looking for an unique and exciting birthday party, a fun-filled friends and family night out, or your next corporate team building event, Trapped has you covered. Book one of our premium escape room adventures today, and experience for yourself why we're the most renowned and beloved escape room chain in the world. Beginners Guide You are trapped. You have one hour, and one mission: Escape! Observe your surroundings, solve clues and make the connection! Uncover the mystery hidden within, find the final key, and escape! What makes us different? At TRAPPED, we believe your adventure begins from the moment you step into our lobby. Every aspect of your experience is tailored to provide you with an escape from your everyday life into something out of this world. Our Game Masters are eagerly waiting to guide you into your personal escape story with our sterling customer service and an atmospheric introduction to the narrative of each of our themes. We’ll be on hand throughout your escape to provide just enough assistance to give you a satisfyingly challenging experience. Once your journey to freedom begins, you’ll discover that narrative and story are at the heart of everything we do. At TRAPPED, your escape is not just a puzzle or a game, but a story that you are an integral part of. Everything in the game is designed with realism and immersion in mind and can be touched, examined, and interacted with. At TRAPPED, you’re not just escaping a room, you’re starring in your own story of adventure, mystery, and suspense! Happy Participants Corporate Events Social Media Followers Success Rate Copyright 2024 © Trapped. All Rights Reserved. Ajax Barrie Burlington Burnaby Calgary Coquitlam Edmonton Guelph Kanata Markham Mississauga Newmarket Niagara Falls Oshawa Ottawa Scarborough Toronto Downtown Toronto Midtown Vaughan Waterloo Windsor", "latitude": 43.6493911, "longitude": -79.39512839999999}, {"name": "Captive Escape Rooms Downtown Toronto", "text": "THE BEST 60 MINUTES OF YOUR DAY ALL GAMES NOW PRIVATE!  Gather your team, put away your phones and transport yourself to another world! Frequently Asked Questions There are no jump scares and we do not have any live actors in the rooms, it will just be you and your team working together. We cannot guarantee you won’t feel nervous at times, the most important question is this: do you scare easily? No, you can leave at any time. The door you enter through is always unlocked, it’s the doors ahead of you that are locked. Yes! The games are designed for ages 13 up, anyone below the age of 16 must be accompanied by an adult.  If you are looking for escape rooms specifically for children and families then you may want to check out Captive Kids. “Had an AMAZING time doing this escape room-the perfect balance of challenging and enjoyable” — Trip Advisor   Corporate Outings Escape the office Build teamwork Have a lot of fun We Make Great Teams A Little Better Looking for Escape Rooms for Kids and Families?   Choose Your Location    Careers", "latitude": 43.6571929, "longitude": -79.38367339999999}, {"name": "Looking Glass Adventures", "text": "Toronto’s Top Rated Escape Room 4 Thrilling and Immersive Escape Rooms to Choose From! Intriguing Private Adventures for all groups and ages. Call or text now - (647) 498-5596 Canadian owned and operated Mystery at Maryweather Mansion Mission: Step into the shoes of a world-renowned archaeologist Jayne Maryweather! Can you find her most valued treasure in time? Features: Larger groups will love the ample space , newer players will appreciate the intuitive puzzles, enthusiasts will enjoy the narrative and how well the puzzles tie into the theme. This game is a beloved fan favourite and one of our more popular games. It fits a variety of groups and group sizes. Works well for 2 players too! It Came From the Attic! Mission: As investigators for the World Society of Adventurers you have been called to the house of James Underwood, a paranormal researcher who needs you to find proof of the supernatural!  Features: Maximized space and multilinear gameplay that is suitable for a variety of players. Story-driven, slightly spooky (but not scary or horror based) with twists, turns and thrills. Challenging but enjoyable puzzles and not impossible. Voted a \"Best of Morty\" 2024 winner! 🌟 Morty is the go-to platform where escape room enthusiasts worldwide rate and review the best games— and we made the list! 🔐✨\n\n\nDifficulty: 3.5/5\n\nNumber of Players: 2-10\n\nTime: 60 Minutes\n\n \n\n\nDifficulty: 3.5/5\n\nNumber of Players: 2-10\n\nTime: 60 Minutes\n\n Walden's Wizarding Shop Mission: Calling all magic enthusiasts and wizarding fans! Walden's shop has everything you require for your magical needs. But wait, something's not right - the shop is unattended, and evil forces are lurking. Features: Cozy and beautifully themed! Magical puzzles with a magical theme. Challenging puzzles which will require teams to communicate well. Original and unique puzzles never seen before! This game is realistic, immersive and full of magical surprises. Bullseye Award winner in the \"Best Fantasy\" category. Operation Flamingo- Secret Agent Mission: Attention all secret agents! You and your team have just parachuted into a quiet residenal area in Florida with a mission to infiltrate a house! There is just one hour to extract dangerous items and get out. Features: Optional retro dance party photo op! Large open space perfect for larger teams. Comical story which is fun for young and old. High tech and action packed which is perfect for any corporate players. Original mechanical and multi-tasking puzzles all with a retro 80's vibe that will take this game to the next level. The fun and kitschy vibe is a refreshing change from many themes. This makes it perfect for more hesitant players. Don't be fooled by the difficulty as you'll have some challenging puzzles in here, but as always we're there to help! Pricing Private, multi-room games (we don’t put you in with anyone else) 2 player games priced at $40 each plus HST We require a paying and participating adult with all kids 11 years and under. Thrifty Thursday Special- book any Thursday for $5 off per player! From 3:45-11pm. Use code ThriftyThursday on checkout.   Escape room adventures perfect for families, friends, team-building, and more.  See why we have over 1600 Five-Star Google Reviews!  We are located at 2944 Danforth Ave., on the North side of the street. We’re in the basement of a 4 story building at the corner of Sibley and Danforth. You can find our entrance to the left of the Sherwin-Williams Paint store. There is pay street parking on the Danforth on both the north and south side of the street. Make sure to give yourself some time to park and arrive 10 minutes prior to your game time. If you are travelling by TTC (Subway) we are located between Main and Victoria Park stations.  If you have any trouble locating us you can always give us a call at (647) 498-5596. Our hours vary depending on bookings. Walk-ins are not guaranteed to find a game especially on weekends when we tend to be fully booked. It’s always best to call before you come for a visit. Team Building at Looking Glass Adventures Looking for a way to increase team bonding in an exciting environment? We have you covered. Read all about it here: What makes Looking Glass Adventures Unique and Top Rated? Our games don’t contain any scary or offensive themes - they are designed with groups of all different players in mind. With 4 games to choose from, there is something for everyone. While we do have lights and effects, there are no jump scares or horror aspects to our stories - and our puzzles are achievable without any outside knowledge required. Our goal is for you to have fun in a mysterious and exciting environment with excellent game flow and unexpected twists and turns. 2944 Danforth Ave.Toronto, Ontario(647) 498-5596 info@lookingglassadventures.com Follow InstagramFacebook Interested in joining our team? Check out our careers page.", "latitude": 43.6903334, "longitude": -79.293008}, {"name": "Roundabout Canada Escape Room", "text": "Home Rooms\n\nThe Prisoner\nButcher’s Basement\nFinal Destination 2.0\nBack To The Mummy\nThe Ninja\n\n The Prisoner Butcher’s Basement Final Destination 2.0 Back To The Mummy The Ninja Gifts Corporate Events\n\nSpecial Events\n\n Special Events Reviews Contact Do you have what it takes to ESCAPE? EMBARK ON AN IMMERSIVE ADVENTURE WITH YOUR CHOSEN GROUP, WHETER IT'S A SMALL GATHERING, OR A LARGER TEAM.\n\n60 MIN.  $36 + tax per person Escape Rooms Back To The Mummy The Ninja Butcher’s Basement Final Destination 2.0 The Prisoner Corporate Events Gameplay Footage Birthday Parties Corporate Events Special Events Customer Reviews About Us Get Locked Look Around Team Work Solve Puzzles Time's Ticking Free Yourselves Frequently Asked Questions What is an escape room? How long does 1 game take? Can I play more than one game? Do I need to bring anything? Is there an age limit? Is there a cancellation fee? Are all of your rooms scary? Will other people join our room? How can I book the room online? Can I add people after I book? Can I take pictures / record videos? Which payment methods? What if my group arrives late? How do we prepare for The Ninja? Our Location Mon – Thurs: 12pm- 12am,  Fri: 12pm – 1amSat: 11am – 1am,  Sun: 11am – 12am Visit Us We look forward to hosting your next escape room experience. Contact Form   330 Yonge Street, 2nd Floor\nDowntown Toronto, M5B 1R8\nOntario, Canada info@roundaboutcanada.com\n+1 647-712-2688 Home Escape Rooms Corporate Events Contact Partnership Privacy Policy Terms of Use \nMonday:\n1PM - 12AM\n \nTuesday:\n1PM - 12AM\n \nWednesday:\n1PM - 12AM\n \nThursday:\n1PM - 12AM\n \nFriday:\n1PM - 1AM\n \nSaturday:\n11AM - 1AM\n \nSunday:\n11AM - 12AM\n \n\n\n\n \n\n\n\n \n\n\n\n \n\n\n\n \n\n\n\n \n\n\n\n", "latitude": 43.6572981, "longitude": -79.38161649999999}, {"name": "Daydream Adventures", "text": "Home Coming Soon Dream Portal The Ice Cave FAQ Gift Certificates Book Now About Home Coming Soon Dream Portal The Ice Cave FAQ Gift Certificates Book Now About Home Our Escape Rooms\n\nComing Soon\nDream Portal\nThe Ice Cave\n\n Coming Soon Dream Portal The Ice Cave FAQ Gift Certificates Home Our Escape Rooms\n\nComing Soon\nDream Portal\nThe Ice Cave\n\n Coming Soon Dream Portal The Ice Cave FAQ Gift Certificates Toronto's First Immersive Art Escape Room An escape room  you won't want to escape from Welcome to Daydream Adventures Toronto’s first and only immersive art escape room Discover Toronto’s most captivating escape room experience at Daydream Adventures, located in the heart of the Danforth. Immerse yourself in a world created by local Toronto artists, where every detail of our handcrafted escape rooms brings a new adventure to life. Step beyond the ordinary and into a dynamic storyline filled with challenging puzzles, interactive mysteries, and unforgettable excitement. At Daydream Adventures, your mission is more than just escaping—it’s about engaging in a thrilling journey designed for all ages. Our escape room is prefect for birthday parties, corporate team-building events, date nights or a fun day out with family and friends.   Book your adventure today and experience the most immersive enchanting escape room in Toronto. THE ICE CAVE   A mystical place – a seemingly abandoned temple where powerful artifacts remain frozen. You will explore the remnants of a civilization, that has been left behind.    Dream Portal   This portal leads to a fantastical place – an enchanted forest that’s home to mysterious spirits who bring dreams to mortals.    Are you brave enough to unravel the witch’s dark magic to free the forest spirits?    Dream Portal Your Journey Starts Here RESERVATIONS Book online or call us to book your experience   COST  36 CAD + TAX per person    TIME 60 Minutes Game Time \n\t\t\t\t\t\t\t\tICE CAVE\t\t\t\t\t\t\t \n\t\t\t\t\t\t\tExperience the Ice Cave Adventure\t\t\t\t\t\t \n\t\t\t\t\t\t\t\tICE CAVE\t\t\t\t\t\t\t \n\t\t\t\t\t\t\tExperience the Ice Cave Adventure\t\t\t\t\t\t \n\t\t\t\t\t\t\t\tDream Portal\t\t\t\t\t\t\t \n\t\t\t\t\t\t\tExperience the Enchanted Forest Adventure\t\t\t\t\t\t \n\t\t\t\t\t\t\t\tDream Portal\t\t\t\t\t\t\t \n\t\t\t\t\t\t\tExperience the Enchanted Forest Adventure\t\t\t\t\t\t Created By Toronto Artists Our escape room was hand-crafted with the talents of Toronto artists. Daydream\nAdventures has made an alternate world in Toronto’s vibrant Danforth\nneighborhood. You will enter into an adventure like no other. This is a game that\nwill allow you to experience exploring a set so immersive, you may forget you are in an escape room. Our escape room was hand-crafted with the talents of Toronto artists. Daydream\nAdventures has made an alternate world in Toronto’s vibrant Danforth\nneighborhood. You will enter into an adventure like no other. This is a game that\nwill allow you to experience exploring a set so immersive, you may forget you are in an escape room. What people are saying about our Toronto Escape Rooms Our Adventures In the Press Contact Us 1803 Danforth Ave, Toronto, ON M4C 1J2 info@daydreamtoronto.com  437-245-4535  © Copyright Daydream Adventures", "latitude": 43.6842939, "longitude": -79.3186518}, {"name": "Casa Loma Escape Rooms", "text": "Escape Rooms Team Building Location Gift Cards FAQ Book now Casa Loma like youâ\u0080\u0099ve never seen it We can get you in to the most exclusive spots in the castle, but youâ\u0080\u0099ll have to get yourself out We can get you in to the most exclusive spots in the castle, but youâ\u0080\u0099ll have to get yourself out Find your next adventure In a 1920s speakeasy King of the Bootleggers Tonightâ\u0080\u0099s the night we move on notorious bootlegger Rocco Perri and trust me, we need all the help we can get. So, you in or you out? Grab ya ticket now! In a 1920s speakeasy King of the Bootleggers Tonightâ\u0080\u0099s the night we move on notorious bootlegger Rocco Perri and trust me, we need all the help we can get. So, you in or you out? Grab ya ticket now! In a 1920s speakeasy King of the Bootleggers Tonightâ\u0080\u0099s the night we move on notorious bootlegger Rocco Perri and trust me, we need all the help we can get. So, you in or you out? Grab ya ticket now! Escape rooms Escape rooms In the Scottish Tower A great peril has befallen the land of Avalon. Embark on a magical quest to defeat the wicked alchemist Markoth once and for all. Learn more & book In the Scottish Tower A great peril has befallen the land of Avalon. Embark on a magical quest to defeat the wicked alchemist Markoth once and for all. Learn more & book In the Norman Tower The fate of this war rests on your shoulders. Our allies overseas need those coordinates and failure is not an option. Move out! Learn more & book In a 1920s speakeasy Tonightâ\u0080\u0099s the night we move on notorious bootlegger Rocco Perri and trust me, we need all the help we can get. So, you in or you out? Learn more & book In a 1920s speakeasy Tonightâ\u0080\u0099s the night we move on notorious bootlegger Rocco Perri and trust me, we need all the help we can get. So, you in or you out? Learn more & book At the Coachman's Stables Fresh out of the academy youâ\u0080\u0099ve been called on to solve the case of cases: The kidnapping of Detective Murdoch. Learn more & book At the Coachman's Stables Fresh out of the academy youâ\u0080\u0099ve been called on to solve the case of cases: The kidnapping of Detective Murdoch. Learn more & book In the Casa Loma tunnels Infiltrate the underground spy facility and discover the source of the signal. But stay on your toes, agent. Learn more & book In the Casa Loma tunnels Infiltrate the underground spy facility and discover the source of the signal. But stay on your toes, agent. Learn more & book Break the ice And whatever else it takes to get out of the room Plan a teambuilder Casa Loma Casa Loma Casa Loma 1 Austin Terrace, Toronto, ON Our Casa Loma Escape Rooms take place in the famous landmark.  Get directions > The Castle 1 Austin Terrace, Toronto Meet your team at 1 Austin Terrace, Toronto, M5R 1X8. Walk towards the terrace on the East side of the building If you're facing the main doors of Casa Loma, it will be around to your left.  Just past the terrace there will be a black door marked as \"AUTHORIZED PERSONS ONLY.\" Be sure you are not being followed or observed by enemy spies, dragon egg thieves, or other snoopy characters! Ring the gold and black doorbell, wait a moment, then pull the handle to open the door. East entrance of the Castle1 Austin Terrace, Toronto Station M Escape the Tower King of the Bootleggers Dragonâ\u0080\u0099s Song The Stable House 330 Walmer Road, Toronto This game takes place in the historic \"Coachman's Stable House\" on Casa Loma grounds, found next to the stables. The address is 330 Walmer Road, Toronto M5R 2Y4.   If you are planning to travel to your game using Uber, Lyft or a GPS please use the address above. Please enter The Coachman's Stable House through the main entrance on Walmer Road. Your host will greet you there. Stable entrance north of the Castle330 Walmer Road, Toronto Murdoch Mysteries Join our not-so-secret society Get updates, puzzles, and secret codes that unlock distant universes Join our not-so-secret society Get updates, puzzles, and secret codes that unlock distant universes Join our not-so-secret society Get updates, puzzles, and secret codes that unlock distant universes Made with â\u0099¥ by Secret City Studio Made with â\u0099¥ by Secret City Studio Made with â\u0099¥ by Secret City Studio Special Easter Monday time slots available at Casa Loma Escape Rooms! Book now Special Easter Monday time slots available at Casa Loma Escape Rooms! Book now Special Easter Monday time slots available at Casa Loma Escape Rooms! Book now", "latitude": 43.6780932, "longitude": -79.4093817}, {"name": "INBLACK Escape Room Toronto - Eaton", "text": "Home Theme Booking FAQ Contact InBlack InBlack Escape Loading locations...  InBlack  Copyright 2025 - Designed & Developed by InBlack Entertainment RoadMap Cookies Terms & Conditions", "latitude": 43.654687, "longitude": -79.3798559}, {"name": "Trapped Escape Rooms & Board Games Toronto", "text": "Home Themes Rates Corporate Events Franchise Locations & Contact FAQ Book Now!AjaxBarrieBurlingtonBurnabyCalgaryCoquitlamEdmontonGuelphKanataMarkhamMississaugaNewmarketNiagara FallsOshawaOttawaScarboroughTorontoDowntownTorontoMidtownVaughanWaterlooWindsor Ajax Barrie Burlington Burnaby Calgary Coquitlam Edmonton Guelph Kanata Markham Mississauga Newmarket Niagara Falls Oshawa Ottawa Scarborough TorontoDowntown TorontoMidtown Vaughan Waterloo Windsor Real Life Room Escape About Us As one of the largest and most renowned premium escape room chains across the globe, Trapped offers a truly unparalleled immersive escape experience that will leave you enchanted. From intricate puzzles to lavish sets, we take pride in every detail that goes into our game designs. Our mission is to create a world of wonder and adventure, where you can step into a real-life movie scenario and experience the thrill of the unknown. With locations worldwide, Trapped is the go-to destination for those seeking the ultimate in immersive entertainment. Whether you're looking for an unique and exciting birthday party, a fun-filled friends and family night out, or your next corporate team building event, Trapped has you covered. Book one of our premium escape room adventures today, and experience for yourself why we're the most renowned and beloved escape room chain in the world. Beginners Guide You are trapped. You have one hour, and one mission: Escape! Observe your surroundings, solve clues and make the connection! Uncover the mystery hidden within, find the final key, and escape! What makes us different? At TRAPPED, we believe your adventure begins from the moment you step into our lobby. Every aspect of your experience is tailored to provide you with an escape from your everyday life into something out of this world. Our Game Masters are eagerly waiting to guide you into your personal escape story with our sterling customer service and an atmospheric introduction to the narrative of each of our themes. We’ll be on hand throughout your escape to provide just enough assistance to give you a satisfyingly challenging experience. Once your journey to freedom begins, you’ll discover that narrative and story are at the heart of everything we do. At TRAPPED, your escape is not just a puzzle or a game, but a story that you are an integral part of. Everything in the game is designed with realism and immersion in mind and can be touched, examined, and interacted with. At TRAPPED, you’re not just escaping a room, you’re starring in your own story of adventure, mystery, and suspense! Happy Participants Corporate Events Social Media Followers Success Rate Copyright 2024 © Trapped. All Rights Reserved. Ajax Barrie Burlington Burnaby Calgary Coquitlam Edmonton Guelph Kanata Markham Mississauga Newmarket Niagara Falls Oshawa Ottawa Scarborough Toronto Downtown Toronto Midtown Vaughan Waterloo Windsor", "latitude": 43.70494069999999, "longitude": -79.4081035}, {"name": "Adventure City Games Toronto", "text": "\n                Play an Outdoor Escape Room Gamethrough the streets of Toronto!             EMBARK ON AN ADVENTURE WITHAN OUTDOOR ESCAPE ROOM GAME!   What Players Are Saying \n        Game Starting Points in Toronto Book Your Tickets Now An Adventure for Everyone! Bring your favorite people together for a one-of-a-kind city exploration—solve puzzles, uncover secrets, and create lasting memories together as you bond over shared adventures and discover the city’s unique charm. Boost collaboration and creativity with immersive team-building experiences that uncover the city’s hidden gems, fostering stronger connections and innovative thinking while exploring unique cultural and urban treasures. \n        FREQUENTLY ASKED QUESTIONS     \n\n                                    What is Adventure City Games?                                \n \n\n                                    Are the games suitable for everyone?                                \n \n\n                                    How many players can play?                                \n \n\n                                  Do we need to book a specific time to play?                                \n \n\n                                      How much time should we plan for the adventure?                                \n \n        Our partners     Get 25% Off If You Can Solve This Week's Enigma! A new enigma every Wednesday—challenge yourself and claim your reward! \nContact Us | Our Story\n \nFAQs | \n                                    Privacy Policy | Terms & Conditions\n \n                                    Follow is on: Facebook | Instagram\n \nJoin 30,000+ Adventurers Today!\n", "latitude": 43.6522961, "longitude": -79.38146499999999}, {"name": "Adventure City Games Toronto - Distillery District", "text": "\n                Play an Outdoor Escape Room Gamethrough the streets of Toronto!             EMBARK ON AN ADVENTURE WITHAN OUTDOOR ESCAPE ROOM GAME!   What Players Are Saying \n        Game Starting Points in Toronto Book Your Tickets Now An Adventure for Everyone! Bring your favorite people together for a one-of-a-kind city exploration—solve puzzles, uncover secrets, and create lasting memories together as you bond over shared adventures and discover the city’s unique charm. Boost collaboration and creativity with immersive team-building experiences that uncover the city’s hidden gems, fostering stronger connections and innovative thinking while exploring unique cultural and urban treasures. \n        FREQUENTLY ASKED QUESTIONS     \n\n                                    What is Adventure City Games?                                \n \n\n                                    Are the games suitable for everyone?                                \n \n\n                                    How many players can play?                                \n \n\n                                  Do we need to book a specific time to play?                                \n \n\n                                      How much time should we plan for the adventure?                                \n \n        Our partners     Get 25% Off If You Can Solve This Week's Enigma! A new enigma every Wednesday—challenge yourself and claim your reward! \nContact Us | Our Story\n \nFAQs | \n                                    Privacy Policy | Terms & Conditions\n \n                                    Follow is on: Facebook | Instagram\n \nJoin 30,000+ Adventurers Today!\n", "latitude": 43.6492207, "longitude": -79.3772949}, {"name": "The Imaginarium", "text": "Rooms Private Events Corporate Gift Certificates Events Contact Home Rooms Private Events Corporate Gift Certificates Events Contact  The Imaginarium strives to give all our guests a fun immersive experience, we appreciate all the wonderful accolades our guests share on TripAdvisor! ADVENTURE ESCAPE ROOMS The Imaginarium is Toronto's newest escape room adventure! Our escape rooms are designed to be immersive, with theme park quality production value. No expense has been spared, no details have been overlooked. Our puzzles are crafted to be challenging, logical and FUN! Enter the abandoned Grand Wilshire Hotel and meet the ghost that haunts it – Dr. Herman Mudgett. Inside are three trapped souls awaiting their release! You have 1 hour to rescue them. If you don’t succeed then you will be trapped with them forever in the haunted cavern that is – The Grand Wilshire Hotel! The World is in Turmoil! The Egyptian God Amun Ra is angry and has placed a curse on modern day civilization. A catastrophic storm will soon wreak havoc on the earth! You and your team have one hour to enter the Ancient Temple of Ramesses and lift the curse. Armageddon is near as the doomsday clock starts ticking! The Ohm Dynasty Corporation holds the reins of power and is transporting a nuclear weapon called the Steamhammer.  You are Team Bravo – an elite search and recovery squad whose mission is to infiltrate The Ohm Dynasty Steampunk Express Train and reclaim the super weapon! Enter Space Station 19 and board The Galileo. Use your skills and teamwork to pilot your spacecraft through asteroid fields and black holes. Can you unravel the secrets of the cosmos and find your way back to earth before time runs out? Disclaimer:\nThis game incorporates augmented reality. Players are required to wear Microsoft HoloLens 2 eyeglasses for the duration of the experience. Rates & Hours Gift Certificates  Want an original gift idea? Give the gift of thrill and adventure this year!\nPurchase a gift card online and book your escape room now! Testimonials One of the best escape rooms in Toronto!!! Can’t wait for more rooms! The team at Imaginarium are simply the best! We celebrated my daughter’s birthday at The Imaginarium and were blown away by both the service and the experience.\nImpeccably clean, staff on-site very helpful, no detail is overlooked! The escape room had special effects that thrilled my daughter and her friends.I highly recommend The Imaginarium for any group events and birthday parties This place is simply WOW! Amazing! Mind Blown! Very Intuitive! My friends and I are already planning our next excursion here. A New breed of corporate team building Nothing defines “team building” better than being trapped in a room with your closest work mates for an hour, and having to rely on them to help you get out! Better hope you don’t get stuck in there with the boss! Interested in bringing your team? Private Events Add Our Private VIP room to your Escape Room Experience! Available for Various Events & Celebrations, including:\n- Bridal & Bachelor Parties\n- Sport Viewing parties\n- Family Reunions\n- Holiday Gathering\n- Cosplay, Wizardry and Magic Events all Welcomed! Frequently Asked Questions Phone reservations can be taken during our business hours or leave us a message and we will promptly return your call. However, to ensure you receive the date, time and mission you want, we recommend using our on-line reservation system here – it’s available 24/7 and is always up to date! In order to be considered “on time,” you MUST arrive 15 minutes prior to your scheduled mission time to complete our waivers and receive your mission instructions. Late arrivals will be admitted, but because each game is a 60 minute session you will end up with less time to complete your mission. Please note – No refunds will be offered for late arrivals or no-shows. No. The entry door into your mission is also an emergency exit, your safety is our primary concern here at The Imaginarium. So for safety purposes, the main door to your mission is never locked and you can leave through that door at anytime for any reason. Each room has a different set of requirements, including minimum and maximum players, but for the most enjoyable experience, we recommend larger teams of 4 to 10 people. A credit card is required to confirm a reservation online or by phone. Deposit of one admission is needed to complete your reservation. Remaining balance due can be paid onsite prior to game play or online through confirmation email. If you can’t make your reservation or need to make any changes to it, please notify us 24 hours prior to your scheduled mission launch for a full refund. There will be no refunds for no shows, reduced players or cancellations within 24 hours of the scheduled mission. Any large party  events (corporate, birthday parties, etc.) MUST give us 72 hours notice in order to accommodate any changes, add-ons or to cancel their mission.  Cancellation within 72 hours will be subject to 50% cancellation fee. We recommend that if you have some health conditions like a pacemaker, epilepsy, suffer from claustrophobia, anxiety and, or if you are pregnant this might not be the game for you. If you have a physical disability we kindly ask you to contact our staff when booking so we can prepare the appropriate accommodations for you and your group to enjoy the adventure! Good question! While we’d like as many people as possible to enjoy our missions, participants must be at least 13 years old to play. And with that, players between the ages of 13-14 must be accompanied into the rooms by one adult 18+. Those 15 – 17 do not require an adult to be in the room to play but we do ask one adult 18+ to be present in the lobby for the duration of the mission. Well…who’s hot right now? Just kidding. Clothing should be loose and comfortable – and something you wouldn’t mind getting a little dirty. Better to stay home or the bar you were at!  We have a zero tolerance policy regarding participants entering the premises under the influence of alcohol or any mind-altering drugs  —  Remember, our staff reserves the right to refuse entry if they feel you or anyone in your party is under the influence. The Imaginarium © 2025. All rights reserved. | Toronto Web Design By nuBranch Media Please note all Games at The Imaginarium are Private Experiences.", "latitude": 43.7049475, "longitude": -79.4598781}, {"name": "Escape Manor Toronto", "text": "\nBOOK NOW\n \nCART (0) $0.00\n \nContact\n \nGift Cards\n \nFAQ\n \nVIP\n \n|\n \nCart (0) $0.00\n \n\n toronto \n\nVirtual\nToronto\nHamilton\nOttawa Junior\nOttawa\nRegina\nSaskatoon\nBrisbane\n\n\n Virtual Toronto Hamilton Ottawa Junior Ottawa Regina Saskatoon Brisbane \nExperiences\n \nBooking\n \nLounge & Kitchen\n \nEvents & Team Building\n \nContact\n \nGift Cards\n \nFAQ\n \nVIP\n \nChange Cities\n \n\nEscape Manor \n\n\nToronto's Immersive Entertainment Lounge\n\n\nKitchen. Drinks. Axes. Escapes.\n Highlights The Lounge Our Experiences Play traditional or social darts using our innovative technology that counts for you! Choose from 4 fast and exciting games suitable for all skill levels. The \"Power Hour\" is a 60 minute Axe Throwing Experience. Hosted by one of our experienced coaches, your group will play games, tackle group challenges, and finish with a Big Axe before a final champion is crowned. Axe throwing is safe and accessible to all. You and your group will be hitting bullseyes in no time! Robin Hood has been expecting you! The kingdom of Sherwood Forest is in shambles due to Prince John and his dastardly Sheriff of Nottingham. Alas, the prince’s tournament is already in full swing and the deed to the forest is on the line! Will your band of merry men be able to thwart the prince and return the forest to its former glory? To the victor go the spoils! Ten-hut! Fall in line, prisoners. With just one hour until your execution, will you and your crew make it out before you can say your last words? Hope you’ve thought about your last meal inmates, because not many make it out of Death Row alive… A crazed doctor flies at you with a drill: This isn’t looking good for you… In fact, you’re not even sure if Dr. Roth is a real doctor! And by the looks of things, there’s no way you’re going through with any surgery under Roth’s watch. Doctor’s orders? Why, a lobotomy of course! With just one hour until the operation, will you successfully escape before Dr. Roth picks your brain? Lou Cipher’s eyes glimmer as you complete the signature on this soul-binding agreement. Don’t be too hard on yourself, we’ve all tried to make a deal with the devil… Unfortunately for you, you actually went through with it! Now, Lou’s expecting his end of the bargain. Fortunately, he has an appointment open this millennium! How lucky for you! Will you manage to slip from under Cipher’s grasp and escape with your soul intact? An infamous recipe. A wine tasting for the century. You’ve received an invitation to attend Sir Arthur Bradford’s Winery, although rumour has begun to spread. Surely there’s nothing sinister going with a tasty Vino… Right? It’s now up to you sommeliers to uncover what Arthur Bradford’s secret ingredient truly is. I do hope you discover it before he discovers you… Your childhood friend Alex has just inherited a cabin and they’ve invited you for a weekend-getaway before they sell the place for good! However, now that you’ve actually stepped foot into the cabin you can feel something… Otherworldly. Has Alex always looked so… Sinister? With only an hour until the transformation is complete, can you escape the cabin with everyone in one piece before it’s too late? Become a VIP \n\t\t\t\tGo VIP! Sign-up to get deals, first dibs on new rooms and events, receive a sweet birthday gift and be in the know for all things the Manor.\n\t\t\t Thank You \n\t\t\t\tWe look forward to sending you updates about all things Escape Manor! If you shared your bithday with us, we will send you a special gift a few days before the big day.\n\t\t\t GROUPs, Parties, Team Building, Corporate Retreats \n\t\t\tBachelor parties, team outings, birthdays, corporate events, even proposals!  Escape Manor is the perfect venue to handle any and all of your entertainment needs. Escape Manor has hosted some of North America's most recognized brands such as Shopify, Bank of Montreal, TD Bank, Ottawa Senators, The PGA Tour, Cirque Du Soleil, and Members of Parliament for superior team building, coaching, and social functions. There is also no better way to start your bachelor/ette party than getting locked up together!  No matter the occasion we can help you and your guests have a fantastic time and give them something they'll talk about for weeks!\n\t\t Follow Us \nExperiences\n \nBooking\n \nLounge & Kitchen\n \nEvents & Team Building\n \nPrivacy\n \nExperiences\n \nBooking\n \nLounge & Kitchen\n \nEvents & Team Building\n \nPrivacy\n", "latitude": 43.64567479999999, "longitude": -79.3933916}, {"name": "Trivia Escape Rooms", "text": "Choose your theme\n\nHeist at the Nine-Nine\nEscape the Pound\n\n Heist at the Nine-Nine Escape the Pound Gift Cards \n\n\n\n0\n\n\n \n  Fusing Escape Games with pop Trivia three themed rooms to choose from! \"...it was like I was playing through an unaired episode!\" Our escape rooms are like none other, crafting an experience built on references from your favourite TV show, utilizing your love and memory to navigate through. Properly lit, fully accessible and played by all levels of fans! You won't find any jump scares, generic game templates or dark rooms with us. Our team is comprised of nerdy artists, that simply love TV and love creating weird, funny and nostalgic environments. How much trivia can you rely on to escape?  geek out with us By fans, for fans It takes a lot of passion and commitment to pull off these escape games! Why would anyone ever dedicate so much of their life to something as mediocre as a generic template theme? Each theme is crafted based on what our team of artists and game designers can all geek out on. We strive to be the biggest nerd in the room, and invite you to take our crown! Do you think there's a property we may love enough to turn into an escape room? Let us know! a good time, not a long time Our rooms are created with extensive research, artistic craft and many many hours. While it may seem ridiculous to scrap it after just a few months, we strive to continuously push the envelope of the \"new, weird and unique\" world of escape rooms! There are many more ideas we want to explore! Join us on our journey! Otherwise you may miss out forever!  Each theme is usually available for 4 months, but may be much shorter (holiday rooms, special events, experimental themes, etc). research and parody only Disclaimer:Trivia Escape Rooms is not endorsed by any  corporations, media personalities, film studios, film distributors and/or other television programming/networks.No copyright is claimed in this event and to the extent that material may appear to be infringed, I assert that such alleged infringement is permissible under fair use principles in copyright laws. If you believe material has been used in an unauthorized manner, please email triviaescaperooms{at}gmail New Location Located in the Junction Triangle! 1615 Dupont Street. Main floor, fully accessible! Street parking only. Accessible rear parking available upon request only. Multiple rooms! Three themes rotating seasonally! Heist at the Nine-Nine Players 2 - 8 | All Ages | Medium Challenging Gather your squad and don't play Mr. Noice Guy. Know your trivia, solve the puzzles and be declared the Ultimate Human/Genius! Escape the Pound Yes...your dog IS needed to play! Players 2 to 5 Humans | 1 to 2 Pets | 30min | All Ages | Easy Challenging The game is super fun even with a puppy or not-so-smart dog...but a dog will be needed. Sorry cat people. Party Room Have a super large group? Split them up for \"Fastest Escaper\" mode; while Group A plays, the others hang out with our selection of board games, puzzles and trivia sets. Great for birthday parties, school trips, corporate events and team building activities! Stay for an hour or longer with our party packages. Mobile Games Parks, board roms, schools or your living room! Covert any space to an escape room with our mobile trivia pop-up escape games! Great for groups of any size! The main focus of the event, or accompanying other party treats. Pick it up, or have it delivered.Need a Game Master? Our team are great entertainers!More themes coming soon!  How Much to Play? Prices are based on size of groups. The more players, the less cost!  2 players = $28 each 3 to 4 players = $26.50 each 5 to 6 players = $25 each 7 to 8 players = $23.50 each Regarding our party rooms, corporate or large event bookings, please email triviaescaperooms@gmail.com for pricing inquiries. How do Gift Cards work? What if I know NOTHING about the theme? Each game contains puzzles, codes and problem-solving challenges, which anyone can participate in. Knowledge of the theme will certainly help you go faster, and have some more giggles too, but there will be additional resources hidden throughout your gameplay which will teach you to answer each question. Our GameMasters are super fun to help with hints whenever and can tweak questions to work to your knowledge level better. Escape what? Escape rooms are pretty much a board game you walk through, combined with a scavenger hunt. Based on varying themes, you must solve clues, puzzles and in our case, trivia, in order to finish/escape the game/room. Work as a team to communicate, delegate and solve your way out! Is each theme its own TV show or Movie? Each room to escape combines questions from one property, or several of the same themed property (Same Director, genre, sequels, etc). Your knowledge of your FAV will certainly come in handy, but the other properties can still be solved even if you’ve never seen it before through various strategies that provide the answer (codes, jumbles, hidden hints, etc) . I want to play a finished/expired theme still! Each of our themed rooms are only available for a limited time; between 3 to 6 months max. Once we've retired the theme, we compress and revise the game to a deliverable table-top version that we call \"ESCAPE CRATES\". If you missed a theme after we tear it down, look out for the alternative at-home version shortly afterwards. Youth appropriate? Some escape rooms rely on dark, scary environments, but our themes focus on fun, light and well lit themed rooms. We’re very proud of our ‘sets’ with a lot of detail going in to each room…we want you to see it all! All ages are welcome as long as they can be responsible. Fully locked in? Safety is a major concern, so each room you venture into has easily identifiable exits. Our game-master also has eyes on you the entire game, assisting and monitoring for the best and safest experience. Who will I play with? When you book your time slot, it’s only with your own people. No strangers, just friends and family with us. We will not be responsible for coordinating teams for you. Only provided time slots? If you would like to schedule a time slot outside our regular hours we can certainly accommodate special requests. Shoot us an email and we can work something out! Refunds or exchanges? Cancellations with more than 72 hours notice are applicable for a full refund. We are reserving your time slot and since it’s limited capacity we rely on you to come through. If you’re not able to make it, you are responsible for finding someone else to exchange the tickets. Cash only? When/how do I pay? Due to the limited amount of slots available, and the high demand of attendance, payment in full is required to confirm reservation. Contact Us Email us at triviaescaperooms@gmail.comFollow us @triviaescaperoomsPlease message us for our phone number. Find us at1615 Dupont Street, Toronto I acknowledge with gratitude that we operate our business on the unceded, unsurrendered territory of many nations including the Mississaugas of the Credit, the Anishnabeg, the Chippewa, the Haudenosaunee, and the Wendat peoples, whose presence here reaches back to time immemorial and recognize the enduring presence of all First Nations, Métis, and the Inuit peoples.  Instagram Facebook", "latitude": 43.66486099999999, "longitude": -79.45486319999999}, {"name": "Secret City @ Casa Loma", "text": "Escape Rooms Experiences Team Building Gift Cards FAQs Find a game Special Easter Monday time slots available at Casa Loma Escape Rooms! Book now Special Easter Monday time slots available at Casa Loma Escape Rooms! Book now Special Easter Monday time slots available at Casa Loma Escape Rooms! Book now Escape the everyday Escape games and immersive experiences with live actors in extraordinary settings Find your next adventure Find your next adventure Find your next adventure In a historic village Where Dark Things Dwell Toronto's largest outdoor escape room returns May 2. Will you lift the curse in time? Book passage In a historic village Where Dark Things Dwell Toronto's largest outdoor escape room returns May 2. Will you lift the curse in time? Book Passage In a historic village Where Dark things Dwell Toronto's largest outdoor escape room returns May 2. Will you lift the curse in time? Book passage What's on now What's on now What's on now Escape from\nthe Tower up to 12 players 12+ In a castle tower The \nDragon's\nSong up to 12 players 12+ In a castle tower The \nDragon's\nSong up to 12 players 12+ In a castle tower The \nDragon's\nSong up to 12 players 12+ In a castle tower Murdoch\nMysteries up to 12 players 12+ As seen on TV King of the\nBootleggers up to 15 players 12+ In a 1920s speakeasy King of the\nBootleggers up to 15 players 12+ In a 1920s speakeasy King of the\nBootleggers up to 15 players 12+ In a 1920s speakeasy See all our games See all our games See all our games â\u0080\u009cThe set-up was super cool, creating an immersive atmosphere. It was a fantastic experience that my friends and I loved.â\u0080\u009dCatherine, Station M â\u0080\u009cThe set-up was super cool, creating an immersive atmosphere. It was a fantastic experience that my friends and I loved.â\u0080\u009d Catherine, Station M â\u0080\u009cLoved it. Awesome adventure for our entire family. Actors added to the excitement of the event. Setting was spectacular and the puzzles so creative. Will definitely do it again.â\u0080\u009dSusan, Escape from the Tower â\u0080\u009cLoved it. Awesome adventure for our entire family. Actors added to the excitement of the event. Setting was spectacular and the puzzles so creative. Will definitely do it again.â\u0080\u009d Susan, Escape from the Tower â\u0080\u009cWe have done escape rooms before, but never with such a believable environment! The actors were funny, helpful, and charismaticâ\u0080\u009dChristine, Dragon's Song â\u0080\u009cWe have done escape rooms before, but never with such a believable environment! The actors were funny, helpful, and charismaticâ\u0080\u009d Christine, Dragon's Song â\u0080\u009cI felt like I was in a movieâ\u0080\u009dRehman, King of the Bootleggers â\u0080\u009cI felt like I was in a movieâ\u0080\u009d Rehman, King of the Bootleggers Break the ice And whatever else it takes to get out of the room Plan a teambuilder Break the ice And whatever else it takes to get out of the room Plan a teambuilder Break the ice And whatever else it takes to get out of the room Plan a teambuilder Murder mystery dinner The Perfect Bite They say never play with your food, but those people never had to solve a murderâ\u0080¦ Book your table Murder mystery dinner The Perfect Bite They say never play with your food, but those people never had to solve a murderâ\u0080¦ Book your table Murder mystery dinner The Perfect Bite They say never play with your food, but those people never had to solve a murderâ\u0080¦ Book your table Escape the everyday Join our not-so-secret society to receive secret promos, exclusive updates, and thrilling puzzles. Contact About Careers Gift Cards FAQs Escape Rooms Experiences Team Building Locations Â© 2024 Secret City Adventures. All Rights Reserved. Made with by Secret City Studio Escape the everyday Join our not-so-secret society to receive secret promos, exclusive updates, and thrilling puzzles. Contact About Careers Gift Cards FAQs Escape Rooms Experiences Team Building Locations Â© 2024 Secret City Adventures. All Rights Reserved. Made with by Secret City Studio Escape the everyday Join our not-so-secret society to receive secret promos, exclusive updates, and thrilling puzzles. Contact About Careers Gift Cards FAQs Escape Rooms Experiences Team Building Locations Â© 2024 Secret City Adventures. All Rights Reserved. Made with by Secret City Studio", "latitude": 43.6786349, "longitude": -79.41071409999999}, {"name": "Escape The Ghost Ship", "text": "Escape The Ghost Ship Now playing inBarrie, Hamilton, Ottawa, and Toronto Searching Availability... All who 'ave a mind to distinguish themselves, board this here ship an' make yer fortune! What To Expect Immersive Experience This here experience takes place on board a real boat that be sailin' in real water. Actors be in character as pirates.  Live Actor This here game will have live actors but they will respect yer space an' shan’t be touchin’ ye. General Admission Some of the crew may be known to ye, some may not. Ye’ll need to work together as one crew to get back ashore. The price you see listed is for one individual ticket. Words From Some Mates Who’ve Enjoyed The Voyage! Leroy D. “One of the most fun escape rooms I’ve done so far! Perfect for an evening of skullduggery and shenanigans with a great view on water while you solve puzzles with friends, and the whole evening was complete by great pirate staff to set the sea fairing mood!” R B “Very fun! We went during sunset and it was great. Go with 4+ people for best results though! Great team working. Thanks!” Siobhán A. “Love to escape, love pirates. Very fun escape room with a unique concept, and a spooky adventure. Five stars to the captain, to the crew, and to my team for being able to solve the puzzle with minutes to spare.” Cindel W. “My first escape room experience! And it was amazing! We were lucky enough to be out on the water to enjoy the Canada Day fireworks! Incredible how so many clues and puzzles were creatively spread around the ship! Hats off to the crew and my team for making it out... Alive!” Chris P. “The puzzles were about-right (with some help from the captain...) and the view of the Toronto skyline at night was incredible, though I only remembered to look up a few times. After a couple-dozen escape rooms, this one was fun and in a unique setting.” Lisa C. “We escaped the Ghost Ship! Our Captain Kelly (Josh) was so much fun and plays the role so naturally! Our pilot took us out into the Harbour with stunning views while we solves the puzzles and kept our souls!! Thanks to Josh and crew for a great adventure” booking@escapetheship.com+1 (800) 300-2732 Contact Us At 5:45pm  -  7:45pm  -  9:45pmThursday through SundayTeam Building, Corporate & Private Bookings on Request Games Times Available At About Us  Privacy Follow Us!", "latitude": 43.6361433, "longitude": -79.3966119}, {"name": "Escape Box", "text": "toronto IS YOUR playground Join us on a series of immersive journeys through the streets of Toronto to unlock the mysteries of what lies behind our everyday world. Escape Box games combine the thrill of a scavenger hunt with the challenge of mind-bending puzzles. Each box equips you with an array of physical objects and clues that guide you through a series of puzzles that blend the everyday with the unimaginable. Every puzzle solved draws you closer to uncovering a sinister secret, with the fate of Toronto hanging in the balance. Escape Box is available to rent from BoardGame2Go. Visit the BoardGame2Go website to book your experience now.  Episode 1: Return from Unreality   In \"Return from Unreality,\" you and your partner or group will embark on a gripping Escape Box adventure led by an enigmatic figure lost in the depths of Unreality. As you traverse through the streets of Toronto, you must decipher cryptic clues and unravel the mysteries that blur the lines between dreams and reality. Every twist and turn will bring you closer to uncovering the truth hidden within the shadows of this mysterious realm, with the fate of both the enigmatic guide and your own world hanging in the balance. Number of players: 2-5 Difficulty: Medium Area of play: From Portland Street/Graffiti Alley to the intersection of Queen Street West and Duncan Street Estimated time required: 1.5 hours Tools required: The Return from Unreality Escape Box from BoardGame2Go, the app* and comfortable walking shoes *There is a QR code on the Return from Unreality Escape Box which will take you to the webapp. Visit BoardGame2Go to rent Return from Unreality Reserve the game online and pick up in store. The game begins inside BoardGame2Go’s location at 423 Queen St W #106, Toronto, ON M5V 2A5  Follow ESCAPE BOX on instagram escapebox.ca 2023 © EscapeBox", "latitude": 43.64873559999999, "longitude": -79.3952314}, {"name": "Levelup Virtual Reality (VR) Arcade | Events, Parties, & Team Building", "text": "Limited Time Promotion! BOOK NOW GAMES\n\nGAMES LIST\nARCADE\nARCHERY\nAQUARIUM\nESCAPE ROOM\nHORROR\nZOMBIES\nMINI GOLF\nAIRSOFT\nPAINTBALL\nLASER TAG\nPLANETARIUM\nMUSIC\nADVENTURE\nEDUCATIONAL\nBASKETBALL\nBADMINTON\nBILLIARDS\n\n GAMES LIST ARCADE ARCHERY AQUARIUM ESCAPE ROOM HORROR ZOMBIES MINI GOLF AIRSOFT PAINTBALL LASER TAG PLANETARIUM MUSIC ADVENTURE EDUCATIONAL BASKETBALL BADMINTON BILLIARDS GIFT EVENTS\n\nBOOK EVENT\nDATE NIGHT\nTEAM BUILDING\nCORPORATE EVENT\nBIRTHDAY PARTY\nKIDS BIRTHDAY\nGROUP ACTIVITY\nBACHELOR PARTY\nFAMILY ACTIVITIES\nHOLIDAY EVENT\nMOBILE VR RENTAL\n\n BOOK EVENT DATE NIGHT TEAM BUILDING CORPORATE EVENT BIRTHDAY PARTY KIDS BIRTHDAY GROUP ACTIVITY BACHELOR PARTY FAMILY ACTIVITIES HOLIDAY EVENT MOBILE VR RENTAL FAQ MEMBERSHIP ABOUT US BOOK NOW GAMES\n\nGAMES LIST\nARCADE\nARCHERY\nAQUARIUM\nESCAPE ROOM\nHORROR\nZOMBIES\nMINI GOLF\nAIRSOFT\nPAINTBALL\nLASER TAG\nPLANETARIUM\nMUSIC\nADVENTURE\nEDUCATIONAL\nBASKETBALL\nBADMINTON\nBILLIARDS\n\n GAMES LIST ARCADE ARCHERY AQUARIUM ESCAPE ROOM HORROR ZOMBIES MINI GOLF AIRSOFT PAINTBALL LASER TAG PLANETARIUM MUSIC ADVENTURE EDUCATIONAL BASKETBALL BADMINTON BILLIARDS GIFT EVENTS\n\nBOOK EVENT\nDATE NIGHT\nTEAM BUILDING\nCORPORATE EVENT\nBIRTHDAY PARTY\nKIDS BIRTHDAY\nGROUP ACTIVITY\nBACHELOR PARTY\nFAMILY ACTIVITIES\nHOLIDAY EVENT\nMOBILE VR RENTAL\n\n BOOK EVENT DATE NIGHT TEAM BUILDING CORPORATE EVENT BIRTHDAY PARTY KIDS BIRTHDAY GROUP ACTIVITY BACHELOR PARTY FAMILY ACTIVITIES HOLIDAY EVENT MOBILE VR RENTAL FAQ MEMBERSHIP ABOUT US BOOK NOW GAMES\n\nGAMES LIST\nARCADE\nARCHERY\nAQUARIUM\nESCAPE ROOM\nHORROR\nZOMBIES\nMINI GOLF\nAIRSOFT\nPAINTBALL\nLASER TAG\nPLANETARIUM\nMUSIC\nADVENTURE\nEDUCATIONAL\nBASKETBALL\nBADMINTON\nBILLIARDS\n\n GAMES LIST ARCADE ARCHERY AQUARIUM ESCAPE ROOM HORROR ZOMBIES MINI GOLF AIRSOFT PAINTBALL LASER TAG PLANETARIUM MUSIC ADVENTURE EDUCATIONAL BASKETBALL BADMINTON BILLIARDS GIFT EVENTS\n\nBOOK EVENT\nDATE NIGHT\nTEAM BUILDING\nCORPORATE EVENT\nBIRTHDAY PARTY\nKIDS BIRTHDAY\nGROUP ACTIVITY\nBACHELOR PARTY\nFAMILY ACTIVITIES\nHOLIDAY EVENT\nMOBILE VR RENTAL\n\n BOOK EVENT DATE NIGHT TEAM BUILDING CORPORATE EVENT BIRTHDAY PARTY KIDS BIRTHDAY GROUP ACTIVITY BACHELOR PARTY FAMILY ACTIVITIES HOLIDAY EVENT MOBILE VR RENTAL FAQ MEMBERSHIP ABOUT US BOOK NOW GAMES\n\nGAMES LIST\nARCADE\nARCHERY\nAQUARIUM\nESCAPE ROOM\nHORROR\nZOMBIES\nMINI GOLF\nAIRSOFT\nPAINTBALL\nLASER TAG\nPLANETARIUM\nMUSIC\nADVENTURE\nEDUCATIONAL\nBASKETBALL\nBADMINTON\nBILLIARDS\n\n GAMES LIST ARCADE ARCHERY AQUARIUM ESCAPE ROOM HORROR ZOMBIES MINI GOLF AIRSOFT PAINTBALL LASER TAG PLANETARIUM MUSIC ADVENTURE EDUCATIONAL BASKETBALL BADMINTON BILLIARDS GIFT EVENTS\n\nBOOK EVENT\nDATE NIGHT\nTEAM BUILDING\nCORPORATE EVENT\nBIRTHDAY PARTY\nKIDS BIRTHDAY\nGROUP ACTIVITY\nBACHELOR PARTY\nFAMILY ACTIVITIES\nHOLIDAY EVENT\nMOBILE VR RENTAL\n\n BOOK EVENT DATE NIGHT TEAM BUILDING CORPORATE EVENT BIRTHDAY PARTY KIDS BIRTHDAY GROUP ACTIVITY BACHELOR PARTY FAMILY ACTIVITIES HOLIDAY EVENT MOBILE VR RENTAL FAQ MEMBERSHIP ABOUT US Toronto’s Highest Rated Unlimited VR Experiences. Hourly & Event Bookings. VR ARCADE Unlimited VR Experiences. Hourly & Event Bookings. An Immense THRILL. Levelup Virtual Reality Arcade in Toronto takes you beyond the limits of reality into a rich immersive VR experience. ONE HOUR VR SESSION Your Own VR Station – training + gameplay80+ Single/Multiplayer VR Library – unlimited game changesDedicated VR Attendants to assist and personalise your session NEW! Haptic Suit Add-On ONE HOUR VR SESSION Your Own VR Station Unlimited Single/Multiplayer VR GamesDedicated VR Attendants NEW! Haptic Suit Add-On About Levelup VR Toronto Levelup Reality is the leading virtual reality (VR) arcade in downtown Toronto with a multitude of arcade games. We will transport you entirely out of your own world and into another—whether it is walking along the edge of Everest or surviving a zombie apocalypse, your next reality is limitless. Levelup Reality has been ranked as a leading indoor tourist attraction in Toronto while being a fun and adventurous VR place in the Downtown Toronto GTA. We also host the best corporate events, business team building games, and large group game parties for companies and offices in Toronto. The VR Experience FOR EVERYONE.\n\n Finding Toronto indoor activities everyone loves can be a challenge when you’re in a group. Levelup Reality’s event venue makes it easy to host group activities, including birthday parties, corporate events, holiday parties, bachelor parties, and mobile VR events. Date Night Perfect for couples bonding Team Building Boost collaboration and teamwork Corporate Events Ideal for professional gatherings Birthday Party Fun celebrations for all ages Kids Birthday Parties Perfect for young adventurers VR GROUP ACTIVITIES Great for friends and families Bachelor | Bachelorette Unforgettable pre-wedding fun  HOLIDAY EVENTS Festive and seasonally themed Mobile VR Rental Convenient and immersive Trusted by Leading Brands Showcase your brand among the best. Our VR experiences have transformed team-building events for companies in Toronto. New: Haptic Suit Add-On Elevate your experience with our 16-point haptic suits, delivering real-time tactile feedback for an unparalleled VR adventure. Find The Game FOR YOU. Levelup VR Toronto offers 80+ virtual reality experiences and arcade games including action, adventure, sports, horror, survival, escape room VR games, and more! VR Arcade Games Relive classic gaming thrills with cutting-edge VR technology VR Archery Feel the thrill of the bowstring as you test your precision VR Escape Rooms Unravel mysteries in thrilling VR worlds together VR Aquarium Dive into breathtaking underwater paradise VR Mini Golf / Putt Putt Embark on a whimsical journey through breathtaking courses VR Airsoft Gear up for an adrenaline-filled tactical combat experience VR Laser Tag Light up the arena with electrifying laser battles VR Planetarium Journey across galaxies and explore the wonders of space VR PaintBall Team up or battle it out in fast-paced VR paintball chaos How It Works Step Into the World of Virtual Reality. At Levelup Reality, we make exploring virtual worlds simple and accessible for everyone. Whether you’re a first-timer or a seasoned player, our process ensures an unforgettable experience. Book Your Session Choose Standard or Private Events. Select your preferred date and timeslot. Arrive at Our VR Arcade Friendly staff will begin your training, and VR equipment setup. Enjoy and Share Share photos and videos with friends and family. Tag us on social media! Levelup VR Toronto Highest-rated VR arcade in Toronto – 80+ virtual reality arcade games including action, adventure, sports, horror, survival, and escape room VR games.The best Toronto event venue for corporate events, team building, birthday parties, bachelor parties, group activities, holiday events, and mobile vr rentals. LINKS \n\nGAMES\n\n \n\nGIFT\n\n \n\nEVENTS\n\n \n\nFAQ\n\n \n\nABOUT US\n\n \n\nWAIVERS\n\n \n\nBLOG\n\n CONTACT US \n\n\n \n1 (833) 538–3587\n\n \n\n\n \n[email protected]\n\n LOCATE US \n\n\n \n661 Yonge St., Lower Level, M4Y 1Z9 Toronto\n\n © 2025 LEVELUP REALITY. ALL RIGHTS RESERVED.", "latitude": 43.6682776, "longitude": -79.385815}, {"name": "Sandbox VR", "text": "", "latitude": 43.664527, "longitude": -79.3855384}]